HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMcdslight_regdef.h
/** \brief MCDSLIGHT object */
typedef volatile struct _Ifx_MCDSLIGHT
{
       Ifx_MCDSLIGHT_CLC                   CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_MCDSLIGHT_OCS                   OCS;                    /**< \brief 4, OCDS Control and Status*/
       Ifx_MCDSLIGHT_ID                    ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_MCDSLIGHT_CT                    CT;                     /**< \brief 10, MCDS Control Register*/
       Ifx_MCDSLIGHT_MUX                   MUX;                    /**< \brief 14, MCDS Signal Source Control*/
       Ifx_MCDSLIGHT_SESSIDL               SESSIDL;                /**< \brief 18, Session ID Low Register*/
       Ifx_MCDSLIGHT_SESSIDH               SESSIDH;                /**< \brief 1C, Session ID High Register*/
       Ifx_MCDSLIGHT_MUX_TC_RC             MUX_TC_RC;              /**< \brief 20, MCDS_TC Signal Source Control*/
       Ifx_UReg_8Bit                       reserved_24[212];       /**< \brief 24, \internal Reserved */
       Ifx_MCDSLIGHT_ACCEN1                ACCEN1;                 /**< \brief F8, Access Enable Register 1*/
       Ifx_MCDSLIGHT_ACCEN0                ACCEN0;                 /**< \brief FC, Access Enable Register 0*/
       Ifx_UReg_8Bit                       reserved_100[256];      /**< \brief 100, \internal Reserved */
       Ifx_MCDSLIGHT_FIFONOW               FIFONOW;                /**< \brief 200, Trace Buffer Write Pointer*/
       Ifx_MCDSLIGHT_FIFOBOT               FIFOBOT;                /**< \brief 204, Trace Buffer Bottom Register*/
       Ifx_MCDSLIGHT_FIFOPRE               FIFOPRE;                /**< \brief 208, Trace Buffer PRE/POST Register*/
       Ifx_MCDSLIGHT_FIFOTOP               FIFOTOP;                /**< \brief 20C, Trace Buffer Top Register*/
       Ifx_MCDSLIGHT_FIFOCTL               FIFOCTL;                /**< \brief 210, Trace Buffer Control Register*/
       Ifx_MCDSLIGHT_FIFOWARN              FIFOWARN[2];            /**< \brief 214, Trace Buffer Comparator Register*/
       Ifx_MCDSLIGHT_FIFOOVRCNT            FIFOOVRCNT;             /**< \brief 21C, FIFO Overflow Counter Register*/
       Ifx_MCDSLIGHT_FIFONTNOW             FIFONTNOW;              /**< \brief 220, Trace Buffer Captured Write Pointer*/
       Ifx_UReg_8Bit                       reserved_224[476];      /**< \brief 224, \internal Reserved */
       Ifx_MCDSLIGHT_TSUREFCNT             TSUREFCNT;              /**< \brief 400, Clock Counter Register*/
       Ifx_MCDSLIGHT_TSUPRSCL              TSUPRSCL;               /**< \brief 404, Clock Prescaler Register*/
       Ifx_MCDSLIGHT_TSUEMUCNT             TSUEMUCNT;              /**< \brief 408, Clock Counter Register*/
       Ifx_UReg_8Bit                       reserved_40C[1012];     /**< \brief 40C, \internal Reserved */
       Ifx_MCDSLIGHT_MCXEVT                MCXEVT[24];             /**< \brief 800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_860[32];       /**< \brief 860, \internal Reserved */
       Ifx_MCDSLIGHT_MCXACT                MCXACT[81];             /**< \brief 880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_9C4[60];       /**< \brief 9C4, \internal Reserved */
       Ifx_MCDSLIGHT_MCX                   MCX[16];                /**< \brief A00, */
       Ifx_UReg_8Bit                       reserved_B00[5376];     /**< \brief B00, \internal Reserved */
       Ifx_MCDSLIGHT_TCXDCSTS              TCXDCSTS;               /**< \brief 2000, Debug Status Register*/
       Ifx_UReg_8Bit                       reserved_2004[4];       /**< \brief 2004, \internal Reserved */
       Ifx_MCDSLIGHT_TCXCIP                TCXCIP;                 /**< \brief 2008, Current Instruction Pointer*/
       Ifx_MCDSLIGHT_TCXCFT                TCXCFT;                 /**< \brief 200C, Compact Function Trace Register*/
       Ifx_UReg_8Bit                       reserved_2010[496];     /**< \brief 2010, \internal Reserved */
       Ifx_MCDSLIGHT_TCXPALLUTD            TCXPALLUTD;             /**< \brief 2200, Lookup Table Data Register*/
       Ifx_MCDSLIGHT_TCXPALLUTA            TCXPALLUTA;             /**< \brief 2204, Lookup Table Address Register*/
       Ifx_UReg_8Bit                       reserved_2208[8];       /**< \brief 2208, \internal Reserved */
       Ifx_MCDSLIGHT_TCXPAL                TCXPAL[4];              /**< \brief 2210, */
       Ifx_UReg_8Bit                       reserved_2250[432];     /**< \brief 2250, \internal Reserved */
       Ifx_MCDSLIGHT_TCXEA                 TCXEA[8];               /**< \brief 2400, */
       Ifx_MCDSLIGHT_TCXWD                 TCXWD[4];               /**< \brief 2480, */
       Ifx_MCDSLIGHT_TCXAC                 TCXAC[4];               /**< \brief 2500, */
       Ifx_UReg_8Bit                       reserved_2540[64];      /**< \brief 2540, \internal Reserved */
       Ifx_MCDSLIGHT_TCXDTUFLV             TCXDTUFLV;              /**< \brief 2580, DTU FIFOs Fill Level*/
       Ifx_UReg_8Bit                       reserved_2584[636];     /**< \brief 2584, \internal Reserved */
       Ifx_MCDSLIGHT_TCXEVT                TCXEVT[16];             /**< \brief 2800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_2840[64];      /**< \brief 2840, \internal Reserved */
       Ifx_MCDSLIGHT_TCXACT                TCXACT[24];             /**< \brief 2880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_28E0[1824];    /**< \brief 28E0, \internal Reserved */
       Ifx_MCDSLIGHT_TCXIP                 TCXIP[6];               /**< \brief 3000, */
       Ifx_UReg_8Bit                       reserved_3060[4000];    /**< \brief 3060, \internal Reserved */
       Ifx_MCDSLIGHT_TCYDCSTS              TCYDCSTS;               /**< \brief 4000, Debug Status Register*/
       Ifx_UReg_8Bit                       reserved_4004[4];       /**< \brief 4004, \internal Reserved */
       Ifx_MCDSLIGHT_TCYCIP                TCYCIP;                 /**< \brief 4008, Current Instruction Pointer*/
       Ifx_MCDSLIGHT_TCYCFT                TCYCFT;                 /**< \brief 400C, Compact Function Trace Register*/
       Ifx_UReg_8Bit                       reserved_4010[496];     /**< \brief 4010, \internal Reserved */
       Ifx_MCDSLIGHT_TCYPALLUTD            TCYPALLUTD;             /**< \brief 4200, Lookup Table Data Register*/
       Ifx_MCDSLIGHT_TCYPALLUTA            TCYPALLUTA;             /**< \brief 4204, Lookup Table Address Register*/
       Ifx_UReg_8Bit                       reserved_4208[8];       /**< \brief 4208, \internal Reserved */
       Ifx_MCDSLIGHT_TCYPAL                TCYPAL[4];              /**< \brief 4210, */
       Ifx_UReg_8Bit                       reserved_4250[432];     /**< \brief 4250, \internal Reserved */
       Ifx_MCDSLIGHT_TCYEA                 TCYEA[8];               /**< \brief 4400, */
       Ifx_MCDSLIGHT_TCYWD                 TCYWD[4];               /**< \brief 4480, */
       Ifx_MCDSLIGHT_TCYAC                 TCYAC[4];               /**< \brief 4500, */
       Ifx_UReg_8Bit                       reserved_4540[64];      /**< \brief 4540, \internal Reserved */
       Ifx_MCDSLIGHT_TCYDTUFLV             TCYDTUFLV;              /**< \brief 4580, DTU FIFOs Fill Level*/
       Ifx_UReg_8Bit                       reserved_4584[636];     /**< \brief 4584, \internal Reserved */
       Ifx_MCDSLIGHT_TCYEVT                TCYEVT[16];             /**< \brief 4800, Event Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4840[64];      /**< \brief 4840, \internal Reserved */
       Ifx_MCDSLIGHT_TCYACT                TCYACT[24];             /**< \brief 4880, Action Definition Register ${x}*/
       Ifx_UReg_8Bit                       reserved_48E0[1824];    /**< \brief 48E0, \internal Reserved */
       Ifx_MCDSLIGHT_TCYIP                 TCYIP[6];               /**< \brief 5000, */
       Ifx_UReg_8Bit                       reserved_5060[44960];    /**< \brief 5060, \internal Reserved */
} Ifx_MCDSLIGHT;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXMCDSLIGHT_REGDEF_H */
